Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.AddingOtherConnectedMembersToCircuit
You have selected elements that are connected to other elements. These elements will also be added to the Circuit.